# SERIES & COLUMNS
***
## $Selecting$ $A$ $Single$ $Column$

In [1]:
# Pandas modülünü import edelim
import pandas as pd

In [2]:
# Çalışmamızda kullanacağımız bütün veri setlerini import edelim
houses = pd.read_csv("../data/kc_house_data.csv")
titanic = pd.read_csv("../data/titanic.csv")
netflix = pd.read_csv("../data/netflix_titles.csv", sep="|", index_col=0)

In [3]:
# Titanic veri setinin ilk beş örneğini inceleyelim
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"

In [4]:
# Titanic veri setinin "name" sütununu seçelim
print(titanic.name)

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [5]:
# Aynı işlemi aşağıdaki şekilde de gerçekleştirebiliriz
print(titanic["name"])

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [6]:
# Elde ettiğimiz yapının ne olduğunu görelim
type(titanic["name"])

pandas.core.series.Series

In [7]:
# Titanic veri setinin boyutlarına bakalım
titanic.shape

(1309, 14)

In [8]:
# Age sütununu inceleyelim
titanic["age"]

0           29
1       0.9167
2            2
3           30
4           25
         ...
1304      14.5
1305         ?
1306      26.5
1307        27
1308        29
Name: age, Length: 1309, dtype: object

***
**Yukarıda gerçekleştirdiğimiz işlemleri incelediğinizde, `titanic.age` ile `titanic["age"]` kullanımının aynı sonucu verdiğini görebilirsiniz. Bununla birlikte, güvenlik ve okunabilirlik açısından *`titanic["age]`* kullanımı daha uygundur. Sütun isminde bir *boşluk* karakteri varsa, sütun isminde bir "nokta" işareti varsa, birden fazla sütunu aynı anda kullanmak istiyorsak `.` ile kullanım yanlış tercih olacaktır, `[""]` kullanımı ile bu yanlış tercihin önüne geçilebilir. Bununla birlikte kullandığımız sütun ismi, kod içerisindeki bir sınıf, metot, değişken ismi ile aynı olabilir. Bu durumda karmaşa yaratmamak adına yine `[""]` formatını kullanmak uygun olacaktır. Ayrıca bu formatı kullanarak aşağıdaki dinamik işlemleri de gerçekleştirebiliriz.**
***

In [9]:
ageValue = "age"

In [10]:
titanic[ageValue]

0           29
1       0.9167
2            2
3           30
4           25
         ...
1304      14.5
1305         ?
1306      26.5
1307        27
1308        29
Name: age, Length: 1309, dtype: object

***
## $Closer$ $Look$ $At$ $Series$

**`TANIM`**: Seriler, tek boyutlu etiketli dizilerdir. Etiktet değerleri, indis olarak kullanılabilir. Seri verilerine `values`, indis değerlerine ise `index` metotları ile erişilebilir. Bir yapı, `Series` komutu ile Pandas serisine dönüştürülebilir. Bununla birlite; `value_counts` metodu ile seri içerisinde her bir elemandan kaç adet olduğu yani sıklık bilgisi, `size` metodu ile serinin eleman sayısı, `mode` metodu ile seride en çok tekrar eden eleman bilgisine erişebiliriz.

In [11]:
# Seriler konusunu işlerken "titanic" dataframe'inin "name" sütununu ele alalım
names = titanic["name"]

In [12]:
# "names" değişkenininy yapısını inceleyelim
type(names)

pandas.core.series.Series

In [13]:
# Gördüğünüz üzere "names" Seri veri tipinde bir değişkendir.
print(names)

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [14]:
# Tanım kısmında bahsedilen metotları inceleyelim.
print(f"Values of the \"names\" series: {names.values}\n\n")
print(f"İndexes of the \"names\" series: {names.index}\n\n")
print(f"Value counts of the \"names\" series:\n {names.value_counts}\n")
print(f"Size of the \"names\" series: {names.size}\n\n")
print(f"Mode of the \"names\" series: {names.mode}\n\n")

Values of the "names" series: ['Allen, Miss. Elisabeth Walton' 'Allison, Master. Hudson Trevor'
 'Allison, Miss. Helen Loraine' ... 'Zakarian, Mr. Mapriededer'
 'Zakarian, Mr. Ortin' 'Zimmerman, Mr. Leo']


İndexes of the "names" series: RangeIndex(start=0, stop=1309, step=1)


Value counts of the "names" series:
 <bound method IndexOpsMixin.value_counts of 0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object>

Size of the "names" series: 1309


Mode of the "names" series: <bound method Series.mode of 0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object>

In [15]:
# Serinin etiketi her zaman nümerik olmak zorunda değildir.
# Bunu görmek için mean() metodunu kullanalım. mean() metodu geriye bir seri veri yapısında değişken döner.
houses_mean = houses.mean(numeric_only=True)

In [16]:
# Görüldüğü üzere aşağıdaki serinin etiketleri string tipindedir.
print(houses_mean)

id               4.580302e+09
price            5.400881e+05
bedrooms         3.370842e+00
bathrooms        2.114757e+00
sqft_living      2.079900e+03
sqft_lot         1.510697e+04
floors           1.494309e+00
waterfront       7.541757e-03
view             2.343034e-01
condition        3.409430e+00
grade            7.656873e+00
sqft_above       1.788391e+03
sqft_basement    2.915090e+02
yr_built         1.971005e+03
yr_renovated     8.440226e+01
zipcode          9.807794e+04
lat              4.756005e+01
long            -1.222139e+02
sqft_living15    1.986552e+03
sqft_lot15       1.276846e+04
dtype: float64

In [17]:
# Daha detaylı bakalım
print(houses_mean.index)

Index(['id', 'price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot',
       'floors', 'waterfront', 'view', 'condition', 'grade', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode', 'lat', 'long',
       'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [18]:
# Kontrol edelim
type(houses_mean)

pandas.core.series.Series

In [19]:
# sum() metodu, belirtilen dataframe ya da series tipindeki değişken içerisindeki verileri toplar.
houses.sum()

id                                                  98994056770455
date             20141013T00000020141209T00000020150225T0000002...
price                                                11672925008.0
bedrooms                                                     72854
bathrooms                                                 45706.25
sqft_living                                               44952873
sqft_lot                                                 326506890
floors                                                     32296.5
waterfront                                                     163
view                                                          5064
condition                                                    73688
grade                                                       165488
sqft_above                                                38652488
sqft_basement                                              6300385
yr_built                                                  42599334
yr_renovated                                               1824186
zipcode                                                 2119758513
lat                                                   1027915.4151
long                                                  -2641408.943
sqft_living15                                             42935359
sqft_lot15                                               275964632
dtype: object

In [20]:
# Bir seri için sum() metodunu kullanalım
houses["price"].sum()

11672925008.0

In [21]:
# Veri tiplerini inceleyelim.
print(f"Type of \"houses\": {type(houses)}")
print(f"Type of \"houses.sum()\": {type(houses.sum())}")

print(f"Type of \"houses.price\": {type(houses.price)}")
print(f"Type of \"houses.price.sum()\": {type(houses.price.sum())}")

Type of "houses": <class 'pandas.core.frame.DataFrame'>
Type of "houses.sum()": <class 'pandas.core.series.Series'>
Type of "houses.price": <class 'pandas.core.series.Series'>
Type of "houses.price.sum()": <class 'numpy.float64'>

In [22]:
# Aynı işlemleri max() metodu için de gerçekleştirmek mümkündür.
print(houses.max(numeric_only=True))

id               9.900000e+09
price            7.700000e+06
bedrooms         3.300000e+01
bathrooms        8.000000e+00
sqft_living      1.354000e+04
sqft_lot         1.651359e+06
floors           3.500000e+00
waterfront       1.000000e+00
view             4.000000e+00
condition        5.000000e+00
grade            1.300000e+01
sqft_above       9.410000e+03
sqft_basement    4.820000e+03
yr_built         2.015000e+03
yr_renovated     2.015000e+03
zipcode          9.819900e+04
lat              4.777760e+01
long            -1.213150e+02
sqft_living15    6.210000e+03
sqft_lot15       8.712000e+05
dtype: float64

In [23]:
print(houses["price"].max())

7700000.0

In [24]:
print(type(houses.max()))

<class 'pandas.core.series.Series'>

In [25]:
print(type(houses["price"].max()))

<class 'float'>

In [26]:
# Peki seri veri tipindeki bir değişkenin shape niteliğine baktığımızda ne görürüz?
names.shape

(1309,)

***
## $Important$ $Series$ $Methods$

* `head()`
* `tail()`
* `describe()`
* `unique()`
* `nunique()`
* `nlargest()`
* `nsmallest()`
* `values_counts()`
* `plot()`

In [27]:
# head() metodu üzerinde daha önce durmuştuk, hatırlayalım.
titanic["age"].head(10)

0        29
1    0.9167
2         2
3        30
4        25
5        48
6        63
7        39
8        53
9        71
Name: age, dtype: object

In [28]:
# tail() metodu üzerinde daha önce durmuştuk, hatırlayalım.
netflix["title"].tail(50)

8757                 World Trade Center
8758             World's Busiest Cities
8759             World's Weirdest Homes
8760                   Would You Rather
8761                          Wrong No.
8762                    Wrong Side Raju
8763    WWII: Report from the Aleutians
8764                         Wyatt Earp
8765                                 XX
8766                                XXx
8767            XXX: State of the Union
8768                  Y Tu Mamá También
8769             Y.M.I.: Yeh Mera India
8770                            Yaadein
8771                   Yaara O Dildaara
8772              Yamla Pagla Deewana 2
8773                Yanda Kartavya Aahe
8774                          يوم الدين
8775                    Yeh Meri Family
8776                         Yellowbird
8777                          Yes or No
8778                        Yes or No 2
8779                      Yes or No 2.5
8780                       Yo-Kai Watch
8781            Yo-Kai Watch: The Movie
8782                        Yoga Hosers
8783                               Yoko
8784               Yoko and His Friends
8785                                YOM
8786                       You Can Tutu
8787          You Can’t Fight Christmas
8788                       You Carry Me
8789                You Changed My Life
8790      You Don't Mess with the Zohan
8791                        Young Adult
8792                        Young Tiger
8793               Yours, Mine and Ours
8794                             اشتباك
8795                    Yu-Gi-Oh! Arc-V
8796                         Yunus Emre
8797                          Zak Storm
8798                           Zed Plus
8799                              Zenda
8800                 Zindagi Gulzar Hai
8801                            Zinzana
8802                             Zodiac
8803                        Zombie Dumb
8804                         Zombieland
8805                               Zoom
8806                             Zubaan
Name: title, dtype: object

In [29]:
# describe() metodu değişken ile alakalı bazı istatistiksel bilgilere ulaşmamızı sağlar
houses.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.161300e+04,2.161300e+04,21613.000000,21613.000000,21613.000000,2.161300e+04,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000
mean,4.580302e+09,5.400881e+05,3.370842,2.114757,2079.899736,1.510697e+04,1.494309,0.007542,0.234303,3.409430,7.656873,1788.390691,291.509045,1971.005136,84.402258,98077.939805,47.560053,-122.213896,1986.552492,12768.455652
std,2.876566e+09,3.671272e+05,0.930062,0.770163,918.440897,4.142051e+04,0.539989,0.086517,0.766318,0.650743,1.175459,828.090978,442.575043,29.373411,401.679240,53.505026,0.138564,0.140828,685.391304,27304.179631
min,1.000102e+06,7.500000e+04,0.000000,0.000000,290.000000,5.200000e+02,1.000000,0.000000,0.000000,1.000000,1.000000,290.000000,0.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,2.123049e+09,3.219500e+05,3.000000,1.750000,1427.000000,5.040000e+03,1.000000,0.000000,0.000000,3.000000,7.000000,1190.000000,0.000000,1951.000000,0.000000,98033.000000,47.471000,-122.328000,1490.000000,5100.000000
50%,3.904930e+09,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,0.000000,0.000000,3.000000,7.000000,1560.000000,0.000000,1975.000000,0.000000,98065.000000,47.571800,-122.230000,1840.000000,7620.000000
75%,7.308900e+09,6.450000e+05,4.000000,2.500000,2550.000000,1.068800e+04,2.000000,0.000000,0.000000,4.000000,8.000000,2210.000000,560.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,9.900000e+09,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,1.000000,4.000000,5.000000,13.000000,9410.000000,4820.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

In [30]:
# Seri yapısı üzerinde uygulayalım
houses["price"].describe()

count    2.161300e+04
mean     5.400881e+05
std      3.671272e+05
min      7.500000e+04
25%      3.219500e+05
50%      4.500000e+05
75%      6.450000e+05
max      7.700000e+06
Name: price, dtype: float64

In [31]:
# Seri yapısı üzerinde uygulayalım
netflix["rating"].describe()

count      8803
unique       17
top       TV-MA
freq       3207
Name: rating, dtype: object

In [32]:
# info() metodunu hatırlayalım
netflix.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 894.5+ KB

***
**`dtypes`, geriye bir seri yapısı döner, ilkel bir info() metoduna benzetilebilir.**
***

In [33]:
netflix.dtypes

show_id         object
type            object
title           object
director        object
cast            object
country         object
date_added      object
release_year     int64
rating          object
duration        object
listed_in       object
description     object
dtype: object

In [34]:
# release_year sütununun nümerik olduğunu gördük. describe() metodunu uygulayalım
netflix["release_year"].describe()

count    8807.000000
mean     2014.180198
std         8.819312
min      1925.000000
25%      2013.000000
50%      2017.000000
75%      2019.000000
max      2021.000000
Name: release_year, dtype: float64

In [35]:
titanic["name"].dtype

dtype('O')

***
**`unique()` metodu, seri tipindeki nesnenin içerisindeki unique verileri gösterir.**
***

In [36]:
# bedrooms sütunu içerisinde geçen oda sayılarına bakalım
houses["bedrooms"].unique()

array([ 3,  2,  4,  5,  1,  6,  7,  0,  8,  9, 11, 10, 33])

In [37]:
netflix["rating"].unique()

array(['PG-13', 'TV-MA', 'PG', 'TV-14', 'TV-PG', 'TV-Y', 'TV-Y7', 'R',
       'TV-G', 'G', 'NC-17', '74 min', '84 min', '66 min', 'NR', nan,
       'TV-Y7-FV', 'UR'], dtype=object)

***
**`nunique()` metodu, seri tipindeki nesnenin içerisindeki unique verilerin sayısını gösterir.**
***

In [38]:
print(f"Number of unique data of netflix[\"ratings\"]: {netflix.rating.nunique()}")
print(f"Number of unique data of houses[\"zipcode\"]: {houses.zipcode.nunique()}")
print(f"Number of unique data of houses[\"bedrooms\"]: {houses.bedrooms.nunique()}")

Number of unique data of netflix["ratings"]: 17
Number of unique data of houses["zipcode"]: 70
Number of unique data of houses["bedrooms"]: 13

**Bu noktada belirtmek gerekir ki `nunique()` metodunu çalıştırken default olarak, üzerinde çalıştığımız seri nesnesinin içerisindeki `NaN` verileri saymıyoruz. Eğer `NaN` verileri de saymak istersek `nunique(dropna=False)` şeklinde bir kullanım yapmak gerekir.**

In [39]:
# Örnek vermek gerekirse;
print(f"Number of unique data of netflix[\"ratings\"] without NaN values: {netflix.rating.nunique()}")
print(f"Number of unique data of netflix[\"ratings\"] wiht NaN values: {netflix.rating.nunique(dropna=False)}")

Number of unique data of netflix["ratings"] without NaN values: 17
Number of unique data of netflix["ratings"] wiht NaN values: 18

***
**`nlargest()` metodu, üzerinde çalışılan seri nesnesi içerisndeki ilk beş en büyük veriyi gösterir. Metoda istenilen sayı, parametre olarak verilip görülmek istenen sayıda en büyük veri görülebilir.**
***

In [40]:
houses["price"].nlargest()

7252    7700000.0
3914    7062500.0
9254    6885000.0
4411    5570000.0
1448    5350000.0
Name: price, dtype: float64

In [41]:
houses["price"].nlargest(10)

7252    7700000.0
3914    7062500.0
9254    6885000.0
4411    5570000.0
1448    5350000.0
1315    5300000.0
1164    5110800.0
8092    4668000.0
2626    4500000.0
8638    4489000.0
Name: price, dtype: float64

***
**`nsmallest()` metodu, üzerinde çalışılan seri nesnesi içerisndeki ilk beş en küçük veriyi gösterir. Metoda istenilen sayı, parametre olarak verilip görülmek istenen sayıda en küçük veri görülebilir.**
***

In [42]:
houses["price"].nsmallest()

1149     75000.0
15293    78000.0
465      80000.0
16198    81000.0
8274     82000.0
Name: price, dtype: float64

In [43]:
houses["price"].nsmallest(10)

1149     75000.0
15293    78000.0
465      80000.0
16198    81000.0
8274     82000.0
2141     82500.0
18468    83000.0
3767     84000.0
10253    85000.0
16714    85000.0
Name: price, dtype: float64

In [44]:
titanic["pclass"].nlargest(5, keep="all")

600     3
601     3
602     3
603     3
604     3
       ..
1304    3
1305    3
1306    3
1307    3
1308    3
Name: pclass, Length: 709, dtype: int64

***
**`nlargest()` ve `nsmalles()` metotlarını, seri nesneleri üzerinde kullandık. Peki dataframe'ler üzerinde kullanabilir miyiz?**
***

In [45]:
houses.nlargest(10, ["price"])

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
7252,6762700020,20141013T000000,7700000.0,6,8.00,12050,27600,2.5,0,3,...,13,8570,3480,1910,1987,98102,47.6298,-122.323,3940,8800
3914,9808700762,20140611T000000,7062500.0,5,4.50,10040,37325,2.0,1,2,...,11,7680,2360,1940,2001,98004,47.6500,-122.214,3930,25449
9254,9208900037,20140919T000000,6885000.0,6,7.75,9890,31374,2.0,0,4,...,13,8860,1030,2001,0,98039,47.6305,-122.240,4540,42730
4411,2470100110,20140804T000000,5570000.0,5,5.75,9200,35069,2.0,0,0,...,13,6200,3000,2001,0,98039,47.6289,-122.233,3560,24345
1448,8907500070,20150413T000000,5350000.0,5,5.00,8000,23985,2.0,0,4,...,12,6720,1280,2009,0,98004,47.6232,-122.220,4600,21750
1315,7558700030,20150413T000000,5300000.0,6,6.00,7390,24829,2.0,1,4,...,12,5000,2390,1991,0,98040,47.5631,-122.210,4320,24619
1164,1247600105,20141020T000000,5110800.0,5,5.25,8010,45517,2.0,1,4,...,12,5990,2020,1999,0,98033,47.6767,-122.211,3430,26788
8092,1924059029,20140617T000000,4668000.0,5,6.75,9640,13068,1.0,1,4,...,12,4820,4820,1983,2009,98040,47.5570,-122.210,3270,10454
2626,7738500731,20140815T000000,4500000.0,5,5.50,6640,40014,2.0,1,4,...,12,6350,290,2004,0,98155,47.7493,-122.280,3030,23408
8638,3835500195,20140618T000000,4489000.0,4,3.00,6430,27517,2.0,0,0,...,12,6430,0,2001,0,98004,47.6208,-122.219,3720,14592

In [46]:
houses.nsmallest(10, ["price"])

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
1149,3421079032,20150217T000000,75000.0,1,0.00,670,43377,1.0,0,0,...,3,670,0,1966,0,98022,47.2638,-121.906,1160,42882
15293,40000362,20140506T000000,78000.0,2,1.00,780,16344,1.0,0,0,...,5,780,0,1942,0,98168,47.4739,-122.280,1700,10387
465,8658300340,20140523T000000,80000.0,1,0.75,430,5050,1.0,0,0,...,4,430,0,1912,0,98014,47.6499,-121.909,1200,7500
16198,3028200080,20150324T000000,81000.0,2,1.00,730,9975,1.0,0,0,...,5,730,0,1943,0,98168,47.4808,-122.315,860,9000
8274,3883800011,20141105T000000,82000.0,3,1.00,860,10426,1.0,0,0,...,6,860,0,1954,0,98146,47.4987,-122.341,1140,11250
2141,1623049041,20140508T000000,82500.0,2,1.00,520,22334,1.0,0,0,...,5,520,0,1951,0,98168,47.4799,-122.296,1572,10570
18468,7999600180,20140529T000000,83000.0,2,1.00,900,8580,1.0,0,0,...,5,900,0,1918,0,98168,47.4727,-122.270,2060,6533
3767,1523049188,20150430T000000,84000.0,2,1.00,700,20130,1.0,0,0,...,6,700,0,1949,0,98168,47.4752,-122.271,1490,18630
10253,2422049104,20140915T000000,85000.0,2,1.00,830,9000,1.0,0,0,...,6,830,0,1939,0,98032,47.3813,-122.243,1160,7680
16714,1322049150,20150305T000000,85000.0,2,1.00,910,9753,1.0,0,0,...,5,910,0,1947,0,98032,47.3897,-122.236,1160,7405

***
**Görüldüğü gibi kullanabiliyoruz, ancak seri nesneleri üzerindeki kullanımından farklı olarak bu sefer bütün bir dataframe örneklerini `price` sütununa göre azalan ya da artan şekilde görüyoruz. *Bununla birlikte birden fazla sütunu da bir arada inceleyebiliriz.***
***

In [47]:
houses.nlargest(15, ["bedrooms", "bathrooms"])

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
15870,2402100895,20140625T000000,640000.0,33,1.75,1620,6000,1.0,0,0,...,7,1040,580,1947,0,98103,47.6878,-122.331,1330,4700
8757,1773100755,20140821T000000,520000.0,11,3.00,3000,4960,2.0,0,0,...,7,2400,600,1918,1999,98106,47.5560,-122.363,1420,4960
13314,627300145,20140814T000000,1148000.0,10,5.25,4590,10920,1.0,0,2,...,9,2500,2090,2008,0,98004,47.5861,-122.113,2730,10400
19254,8812401450,20141229T000000,660000.0,10,3.00,2920,3745,2.0,0,0,...,7,1860,1060,1913,0,98105,47.6635,-122.320,1810,3745
15161,5566100170,20141029T000000,650000.0,10,2.00,3610,11914,2.0,0,0,...,7,3010,600,1958,0,98006,47.5705,-122.175,2040,11914
8546,424049043,20140811T000000,450000.0,9,7.50,4050,6504,2.0,0,0,...,7,4050,0,1996,0,98144,47.5923,-122.301,1448,3866
4096,1997200215,20140507T000000,599999.0,9,4.50,3830,6988,2.5,0,0,...,7,2450,1380,1938,0,98103,47.6927,-122.338,1460,6291
6079,9822700190,20140808T000000,1280000.0,9,4.50,3650,5000,2.0,0,0,...,8,2530,1120,1915,2010,98105,47.6604,-122.289,2510,5000
16844,8823900290,20150317T000000,1400000.0,9,4.00,4620,5508,2.5,0,0,...,11,3870,750,1915,0,98105,47.6684,-122.309,2710,4320
4235,2902200015,20150106T000000,700000.0,9,3.00,3680,4400,2.0,0,0,...,7,2830,850,1908,0,98102,47.6374,-122.324,1960,2450
18443,8823901445,20150313T000000,934000.0,9,3.00,2820,4480,2.0,0,0,...,7,1880,940,1918,0,98105,47.6654,-122.307,2460,4400
4035,685000115,20141007T000000,2150000.0,8,6.00,4340,9415,2.0,0,0,...,8,4340,0,1967,0,98004,47.6316,-122.202,2050,9100
1660,9126101740,20141204T000000,490000.0,8,5.00,2800,2580,2.0,0,0,...,8,1880,920,1997,0,98122,47.6086,-122.303,1800,2580
9452,2769600590,20141016T000000,900000.0,8,4.00,4020,7500,1.0,0,0,...,8,2010,2010,1968,0,98107,47.6732,-122.363,1560,3737
18477,1346300150,20141020T000000,3300000.0,8,4.00,7710,11750,3.5,0,0,...,12,6090,1620,1904,0,98112,47.6263,-122.314,4210,8325

In [48]:
houses.nsmallest(15, ["bedrooms", "bathrooms"])

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
875,6306400140,20140612T000000,1095000.0,0,0.00,3064,4764,3.5,0,2,...,7,3064,0,1990,0,98102,47.6362,-122.322,2360,4000
3119,3918400017,20150205T000000,380000.0,0,0.00,1470,979,3.0,0,2,...,8,1470,0,2006,0,98133,47.7145,-122.356,1470,1399
6994,2954400190,20140624T000000,1295650.0,0,0.00,4810,28008,2.0,0,0,...,12,4810,0,1990,0,98053,47.6642,-122.069,4740,35061
9773,3374500520,20150429T000000,355000.0,0,0.00,2460,8049,2.0,0,0,...,8,2460,0,1990,0,98031,47.4095,-122.168,2520,8050
9854,7849202190,20141223T000000,235000.0,0,0.00,1470,4800,2.0,0,0,...,7,1470,0,1996,0,98065,47.5265,-121.828,1060,7200
14423,9543000205,20150413T000000,139950.0,0,0.00,844,4269,1.0,0,0,...,7,844,0,1913,0,98001,47.2781,-122.250,1380,9600
19452,3980300371,20140926T000000,142000.0,0,0.00,290,20875,1.0,0,0,...,1,290,0,1963,0,98024,47.5308,-121.888,1620,22850
18379,1222029077,20141029T000000,265000.0,0,0.75,384,213444,1.0,0,0,...,4,384,0,2003,0,98070,47.4177,-122.491,1920,224341
4868,6896300380,20141002T000000,228000.0,0,1.00,390,5900,1.0,0,0,...,4,390,0,1953,0,98118,47.5260,-122.261,2170,6000
3467,1453602309,20140805T000000,288000.0,0,1.50,1430,1650,3.0,0,0,...,7,1430,0,1999,0,98125,47.7222,-122.290,1430,1650
8477,2569500210,20141117T000000,339950.0,0,2.50,2290,8319,2.0,0,0,...,8,2290,0,1985,0,98042,47.3473,-122.151,2500,8751
8484,2310060040,20140925T000000,240000.0,0,2.50,1810,5669,2.0,0,0,...,7,1810,0,2003,0,98038,47.3493,-122.053,1810,5685
12653,7849202299,20150218T000000,320000.0,0,2.50,1490,7111,2.0,0,0,...,7,1490,0,1999,0,98065,47.5261,-121.826,1500,4675
1149,3421079032,20150217T000000,75000.0,1,0.00,670,43377,1.0,0,0,...,3,670,0,1966,0,98022,47.2638,-121.906,1160,42882
5832,5702500050,20141104T000000,280000.0,1,0.00,600,24501,1.0,0,0,...,3,600,0,1950,0,98045,47.5316,-121.749,990,22549

***
## $Selecting$ $Multiple$ $Lines$

***
**Hatırlarsanız birden fazla sütunu aynı anda seçebilmek için `dataframe[""]` formatını kullanmamız gerekiyordu. Bu format içerisinde `dataframe["sütun_adi"]` şeklinde bir kullanım yaparsak geriye `Series` tipinde bir nesne alyorduk. Ancak `dataframe[""]` formatının içerisine `["sütun_adi1", "sütun_adi2", "sütun_adi3"]` şeklinde bir liste verirsek birden fazla sütunu seçmiş oluruz ve bu seçim geriye `DataFrame` türünde bir nesne döndürür. Sonuçta kullanacağımız yazım formatı şu şekilde olacaktır: `dataframe[["sütun_adi1", "sütun_adi2", "sütun_adi3"]]`.**
***

In [49]:
netflix[["title"]]

                      title
0      Dick Johnson Is Dead
1             Blood & Water
2                 Ganglands
3     Jailbirds New Orleans
4              Kota Factory
...                     ...
8802                 Zodiac
8803            Zombie Dumb
8804             Zombieland
8805                   Zoom
8806                 Zubaan

[8807 rows x 1 columns]

In [50]:
type(netflix[["title"]])

pandas.core.frame.DataFrame

In [51]:
netflix[["title"]].shape

(8807, 1)

In [52]:
netflix[["title", "rating"]]

                      title rating
0      Dick Johnson Is Dead  PG-13
1             Blood & Water  TV-MA
2                 Ganglands  TV-MA
3     Jailbirds New Orleans  TV-MA
4              Kota Factory  TV-MA
...                     ...    ...
8802                 Zodiac      R
8803            Zombie Dumb  TV-Y7
8804             Zombieland      R
8805                   Zoom     PG
8806                 Zubaan  TV-14

[8807 rows x 2 columns]

In [53]:
netflix[["title", "rating"]].tail()

            title rating
8802       Zodiac      R
8803  Zombie Dumb  TV-Y7
8804   Zombieland      R
8805         Zoom     PG
8806       Zubaan  TV-14

In [54]:
houses[["price", "bedrooms", "bathrooms"]]

          price  bedrooms  bathrooms
0      221900.0         3       1.00
1      538000.0         3       2.25
2      180000.0         2       1.00
3      604000.0         4       3.00
4      510000.0         3       2.00
...         ...       ...        ...
21608  360000.0         3       2.50
21609  400000.0         4       2.50
21610  402101.0         2       0.75
21611  400000.0         3       2.50
21612  325000.0         2       0.75

[21613 rows x 3 columns]

In [55]:
houses[["price", "bedrooms", "bathrooms"]].describe()

              price      bedrooms     bathrooms
count  2.161300e+04  21613.000000  21613.000000
mean   5.400881e+05      3.370842      2.114757
std    3.671272e+05      0.930062      0.770163
min    7.500000e+04      0.000000      0.000000
25%    3.219500e+05      3.000000      1.750000
50%    4.500000e+05      3.000000      2.250000
75%    6.450000e+05      4.000000      2.500000
max    7.700000e+06     33.000000      8.000000

In [56]:
# cols isminde bir liste oluşturarak liste içine sütun isimleri veiyoruz.
# Dinamiklik açısından aşağıdaki kod kullanışlıdır.
cols = ["price", "zipcode", "sqft_lot"]
houses[cols]

          price  zipcode  sqft_lot
0      221900.0    98178      5650
1      538000.0    98125      7242
2      180000.0    98028     10000
3      604000.0    98136      5000
4      510000.0    98074      8080
...         ...      ...       ...
21608  360000.0    98103      1131
21609  400000.0    98146      5813
21610  402101.0    98144      1350
21611  400000.0    98027      2388
21612  325000.0    98144      1076

[21613 rows x 3 columns]